{"30835516": ["Zomato", "Moosewood Restaurant", "Jun 27, 2017", "I've been hearing about the Moosewood for years (my mother loves their cookbook), so I had pretty high expectations going in. Frankly, I was...", 2.5, 0, false], "27917652": ["Zomato", "Moosewood Restaurant", "Aug 14, 2016", "Very good restaurant! Lots of vegetarian, vegan, and gluten free options food. Service was great as well! I would come here again any time I...", 5, 0, false], "27917217": ["Zomato", "Moosewood Restaurant", "Aug 14, 2016", "Friendly and inviting, this iconic spot will make any meat lover cast aside all doubt and dive in! The menu offers many tasty options and th...", 5, 0, true], "23938175": ["Zomato", "Moosewood Restaurant", "Jun 09, 2015", "This is a very famous restaurant in Ithaca. It is known around the world. They sell cookbooks and also gear like T-shirts. They are known fo...", 3.5, 2, true], "20821948": ["Zomato", "Moosewood Restaurant", "Nov 14, 2014", "Loved the idea of a different menu every day. Maybe we came on an off-night because our plates were boring and disappointing, especially for...", 0, 1, true], "37926510": ["Zomato", "Collegetown Bagels", "6 months ago", "an excellent way to start the morning or take a break from studying. the bagels and sandwiches are great, there are vegetarian options, and ...", 4, 0, false], "35755165": ["Zomato", "Collegetown Bagels", "8 months ago", "Well I can't really complain about the Ambience and seating arrangement, but their food and drinks could use more work. Beer is good though....", 4, 0, true], "34850652": ["Zomato", "Collegetown Bagels", "10 months ago", "The pizza bagel here is oitrageous. Never heard of anything like it and never tat mated anything as good. The price is pretty nominal too. T...", 4.5, 0, true], "24460866": ["Zomato", "Collegetown Bagels", "Jul 30, 2015", "Great bagels and just about everything else! Fun hangout spot for late night drinks or morning coffee. I like the Rosemary salt bagel the be...", 4.5, 0, false], "24290003": ["Zomato", "Collegetown Bagels", "Jul 14, 2015", "We always stop by Collegetown Bagels when we make our annual summer pilgrimage back to Cornell.  Their pizza bagel is one of my favorite thi...", 5, 0, false], "36838302": ["Zomato", "Just A Taste", "7 months ago", "I went here for dinner with my friends. I must say that at first I was quite sceptical of my meal because tapas is small portion of food, bu...", 4, 0, true], "33564282": ["Zomato", "Just A Taste", "Feb 16, 2018", "Menu changes daily although some items are standards. Most innovative food in Ithaca and the most delicious. We always order their ices for ...", 5, 0, false], "29295522": ["Zomato", "Just A Taste", "Jan 24, 2017", "I was a bit underwhelmed by the experience.  Nothing I ordered really wowed me.  I'm not panning the place - just saying I wouldn't wait for...", 3, 0, false], "23938152": ["Zomato", "Just A Taste", "Jun 09, 2015", "A very cute restaurant downtown with tables so packed together you can't pull out your chair too much or you will hit the person behind you....", 4, 0, true], "20821708": ["Zomato", "Just A Taste", "Aug 12, 2014", "Great Find. We had planned to eat at the Moosewood but were turned off by the long lines and the arrogant staff who informed us that they di...", 0, 0, false], "36601463": ["Zomato", "Viva Taqueria", "8 months ago", "I visited this place last month.  The food here is really good and the staff is very polite and friendly. I ordered some nachos and they wer...", 4, 0, true], "29446739": ["Zomato", "Viva Taqueria", "Feb 10, 2017", "Viva is one of my favorite places in Ithaca. I can sit at the bar for hours! Their margaritas are delicious and their burritos are amazing. ...", 5, 1, false], "26146192": ["Zomato", "Viva Taqueria", "Jan 31, 2016", "Fresh. Delicious. Casual. Counter Service was a bit unwelcoming. Small seating area. Colorful. Will definitely be back next time I'm in Itha...", 4.5, 1, false], "23938003": ["Zomato", "Viva Taqueria", "Jun 09, 2015", "Great Fast Casual food, limited seating, alway packed with customers because the food is so   and made with good ingredients. They have two ...", 5, 0, true], "23870615": ["Zomato", "Viva Taqueria", "Jun 02, 2015", "Quick and pretty good takeout Mexican. Can't go wrong with the Super Nachos. They have habanero jalapeno and chipotle salsa on the side. Pou...", 4, 0, false], "29882012": ["Zomato", "The BoatYard Grill", "Mar 28, 2017", "Great food all around for our table of 10. Really loved the lobster bisque! Service was good, not perfect, but was flexible and apologetic w...", 4.5, 0, false], "20821363": ["Zomato", "The BoatYard Grill", "Aug 29, 2014", "The portion sizes were really small and the food/drinks were overpriced. The food was decent at best. My one waitress spilled my fries all o...", 0, 0, false], "20821360": ["Zomato", "The BoatYard Grill", "Aug 17, 2014", "Good service nice atmosphere But the dishes are average and overpriced. Everything is a la carte. The quality just isn't there.", 0, 0, false], "20821357": ["Zomato", "The BoatYard Grill", "Jun 26, 2014", "Horrible wait, horrible service, food just ok and overpriced. Went once, bad experience. Gave them a second chance, it was worse!\r An aggrav...", 0, 0, false], "20821354": ["Zomato", "The BoatYard Grill", "Jun 19, 2014", "Four for dinner.One meal poorly prepared and served cold. One meal all cold.Third meal was the wrong order.service mediocre. Last time we wi...", 0, 0, false], "29578586": ["Zomato", "Maxie's Supper Club", "Feb 24, 2017", "Awesome raw bar happy hour and weekly specials. The crab cakes are amazing! The slaw that comes with it has blue cheese in it and it makes t...", 5, 1, false], "26478750": ["Zomato", "Maxie's Supper Club", "Mar 08, 2016", "A new Ithaca Fave!We went here for dinner and I'm still thinking about their food! The only issue was knowing how to get in the building oth...", 4, 1, true], "24521106": ["Zomato", "Maxie's Supper Club", "Aug 05, 2015", "Good food, friendly staff, quick service. Loud because everyone is having a great time.  Our grandchildren loved the seafood choices and tha...", 4.5, 0, false], "20821912": ["Zomato", "Maxie's Supper Club", "Sep 11, 2014", "We had a party of three. Good service, but the place wasn't crowded at all being a Thursday night. I had the crawfish étouffée which was p...", 0, 0, true], "20821909": ["Zomato", "Maxie's Supper Club", "Jul 22, 2014", "Exceptional food and service!. Our party of 6 was seated quickly and our server met us at our table with a smile that set the tone for the e...", 0, 0, false], "31535521": ["Zomato", "Ithaca Ale House", "Aug 28, 2017", "Very tasty wings(crispy and just the right amount of sauce and heat). Good burgers, however the doneness level varied a bit for the party. L...", 4, 0, false], "27917231": ["Zomato", "Ithaca Ale House", "Aug 14, 2016", "Tried an item in the menu called the \"perfect burger\". A possible re-name should be the \"average burger\".  Definitely not outstanding. (Tota...", 3, 1, true], "27218141": ["Zomato", "Ithaca Ale House", "May 30, 2016", "Must visit place at Ithaca. We had a good time and the food especially the shrimp fry was awesome. Place is very busy it's the worth to wait...", 4.5, 0, false], "26432925": ["Zomato", "Ithaca Ale House", "Mar 03, 2016", "What a great experience! This bar was very busy so we had to wait for quite some time but it was well worth it. The service staff were very ...", 4, 1, false], "20821591": ["Zomato", "Ithaca Ale House", "Sep 29, 2014", "Great atmosphere, good food, and a good selection of brews.", 0, 0, true], "24327734": ["Zomato", "Taste of Thai", "Jul 17, 2015", "This place has amazing curry and pad Thai. The only place I can find that does Tom kha soup right!! The ambiance is very nice and the servic...", 5, 0, false], "23937653": ["Zomato", "Taste of Thai", "Jun 09, 2015", "This is one of my go-to restaurant when I have guests visiting Ithaca and treats and I want to show them how awsome Ithaca is. The food is c...", 5, 0, true], "20822194": ["Zomato", "Taste of Thai", "Jul 28, 2013", "Great! but no heat.... Might have just been a mistake, but I ordered the massaman curry hot, and was delighted with the flavor, but there wa...", 0, 0, false], "20822191": ["Zomato", "Taste of Thai", "Sep 23, 2012", "Favorite Thai. Great Panang Curry and the service has always been fine - our favorite Thai place, sadly too far from home.", 0, 0, false], "20822188": ["Zomato", "Taste of Thai", "Aug 23, 2012", "Delish!. Was looking for a quick and tasty meal in the Commons late at night. Ran into Taste of Thai and decided to try it. Was blown away b...", 0, 0, false], "31577577": ["Zomato", "Purity Ice Cream Co", "Sep 01, 2017", "I rarely give five star reviews in anything.  However, I think Purity ice cream company deserves it.  On vacation in the finger lakes this...", 5, 0, true], "27924229": ["Zomato", "Purity Ice Cream Co", "Aug 14, 2016", "Ice cream for breakfast??  Sure... But they also serve amazingly delicious actual breakfast foods!!! Pancakes, waffles and great eggy Englis...", 5, 0, true], "25022335": ["Zomato", "Purity Ice Cream Co", "Sep 24, 2015", "Purity recently started serving brunch on the weekends. I can't recommend it highly enough. Get in and enjoy amazing local breakfast food pa...", 4.5, 0, false], "23937638": ["Zomato", "Purity Ice Cream Co", "Jun 09, 2015", "A classic Ithaca ice cream restaurant. Amazing ice cream! They also have seating. Expect long lines in the summer almost all the time.", 5, 0, true], "23935730": ["Zomato", "Purity Ice Cream Co", "Jun 08, 2015", "Its the best ice cream in Ithaca for sure. Get the bulldog crunch or the boomberry. I'm not big on chocolatey ice creams in general so usual...", 4, 0, false], "34851010": ["Zomato", "Ithaca Bakery", "10 months ago", "This place is considered one of the mains of Ithaca. The place is pretty decent on the ambience front and the food is okay too. Had a dewitt...", 3, 0, true], "23938166": ["Zomato", "Ithaca Bakery", "Jun 09, 2015", "This is a favorite among the locals. High quality deli and food. The best bagels in upstate New York I have ever had. Sandwiches run about t...", 5, 0, true], "20821615": ["Zomato", "Ithaca Bakery", "Jul 27, 2014", "Excellent catering service. I organized a family get together in a State Park and had Ithaca Bakery do the catering. They were fantastic!! F...", 0, 0, false], "20821612": ["Zomato", "Ithaca Bakery", "Jul 08, 2014", "Great place to stop. This is a great place to stop for a quick bite. the service is fast and the food is good and there is a lot of variety....", 0, 0, true], "20821609": ["Zomato", "Ithaca Bakery", "Jul 24, 2012", "The food is good but I think it is way too expensive for what you get. I try to frequent establishments that support local growers and it do...", 0, 1, false], "32011918": ["Zomato", "Taste of Thai Express", "Oct 09, 2017", "I cannot say enough good things about this place!!! Whenever I try any other Thai food, I always compare them to Taste of Thai Express in It...", 5, 0, false], "28838575": ["Zomato", "Taste of Thai Express", "Nov 30, 2016", "The staff are always fast, friendly, well-trained, and polite. The food is also consistently excellent and delicious. I like the fact that y...", 5, 0, false], "24638779": ["Zomato", "Taste of Thai Express", "Aug 16, 2015", "My family and I eat at Taste of Thai Express often.  The quality of the food is fabulous for the price.  For us, this is our favorite plac...", 5, 0, false], "24483265": ["Zomato", "Taste of Thai Express", "Aug 01, 2015", "Delicious, hot and fairly fast on a late Friday night. We tried the pad see ew, spicy basil stir fry and Thai fried rice with nice-sized shr...", 4.5, 0, false], "23937679": ["Zomato", "Taste of Thai Express", "Jun 09, 2015", "Lunch time specials are absolutely amazing here. The wait can be a bit long if you don't come early enough since the restaurants fills up fa...", 5, 0, true], "23937958": ["Zomato", "Madeline's", "Jun 09, 2015", "They might just have the best cake, coffee and chai in have ever had! This restaurant used to be only desserts but now has food too. It's on...", 5, 0, true], "20821792": ["Zomato", "Madeline's", "Sep 29, 2013", "Appalled.. My Saturday evening was supposed to be filled with romance, the sophisticated and classy ambiance of a fine dining restaurant and...", 0, 0, false], "20821789": ["Zomato", "Madeline's", "Jul 12, 2013", "Give Dinner a Miss- Dessert is Great!. My husband and I were very disappointed with our visit to Madeline's. We had to wait a very long time...", 0, 0, false], "20821783": ["Zomato", "Madeline's", "Jul 04, 2012", "Wow! Thought I was in Manhattan eating at the MOMA!. Wow! Thought I was in Manhattan. Great professional service in a very cool city vibe. S...", 0, 1, false], "20821780": ["Zomato", "Madeline's", "May 04, 2012", "The several times I've eaten here with others the hostess and waitresses always had an attitude which affects the customers experience. Grea...", 0, 1, false], "30213950": ["Zomato", "Glenwood Pines", "May 01, 2017", "This restaurants is Ithaca’s version of Cheers.    The food is delicious & there is lots of variety on the menu.  The Pines Burgers Rock...", 5, 0, true], "26053359": ["Zomato", "Glenwood Pines", "Jan 20, 2016", "We had a great experience. The waitress was very nice and attentive. The food was delicious!!!! Can't wait to come back! Don't pass this one...", 5, 1, false], "20821513": ["Zomato", "Glenwood Pines", "Aug 09, 2014", "Compost burger. One of the specials of the day and it was excellent", 0, 0, false], "20821510": ["Zomato", "Glenwood Pines", "Jun 25, 2013", "Burgers and Beer. I absolutely loved this no frills restaurant. I took my two friends visiting from the UK hoping it would be a slice of Ame...", 0, 1, false], "20821507": ["Zomato", "Glenwood Pines", "Jul 15, 2012", "Good times. This place brought up so many great memories of restaurants I went to as a kid...before Applebee's, Olive Garden, McDonald's, an...", 0, 2, true], "20822383": ["Zomato", "ZaZa's Cucina", "Dec 21, 2014", "Food was delish! Plastic chairs, not cool!", 0, 0, false], "20822380": ["Zomato", "ZaZa's Cucina", "Jul 13, 2013", "Give it a Miss!. This restaurant was recommended by a friend of my husband, and I was excited as I love Italian. Unfortunately the food was ...", 0, 0, false], "20822377": ["Zomato", "ZaZa's Cucina", "Dec 13, 2010", "Love it. Nice restaurant. not very crowded. \r very good food.\r waiter service is a little slow and the chairs are uncomfortable, but overall...", 0, 0, false], "20822374": ["Zomato", "ZaZa's Cucina", "Nov 24, 2010", "Although the service was spectacular and the food was tasty, we had trouble getting well-cooked ravioli. First undercooked, then overcooked ...", 0, 0, false], "20822371": ["Zomato", "ZaZa's Cucina", "Jul 31, 2010", "Awful dining experience. This restaurant was actually recommended by a friend of mine and at this point I have no idea why. The service was ...", 0, 1, false], "24766946": ["Zomato", "Carriage House Cafe", "Aug 29, 2015", "Absolutely everything I have tried at the carriage house has been incredibly delicious. Their food is beyond amazing. Do yourself a favor an...", 4, 0, false], "20821414": ["Zomato", "Carriage House Cafe", "Mar 05, 2014", "Very disappointed. Coffee was so old you could stand a spoon up in it, IF they had brought me a spoon...or creamer, or sugar... I ordered an...", 0, 0, false], "20821411": ["Zomato", "Carriage House Cafe", "Jan 12, 2013", "Love it", 0, 0, false], "20821408": ["Zomato", "Carriage House Cafe", "Sep 23, 2012", "Nice find. When there is a line outside waiting 10 minutes prior to when the restaurant opens, you know it's going to be good!", 0, 0, false], "20821405": ["Zomato", "Carriage House Cafe", "Dec 13, 2011", "Great food.....interesting service. The food here is DELICIOUS. I'd actually like this place if the staff weren't consistently rude", 0, 0, false], "24571168": ["Zomato", "AGAVA Restaurant", "Aug 09, 2015", "Agava is one of my absolute favorite restaurants of all. Their margaritas are delicious and strong, and their specials are mind blowing! Alw...", 5, 1, false], "24460877": ["Zomato", "AGAVA Restaurant", "Jul 30, 2015", "Wow they make a great burger. This is the perfect restaurant if you want a slightly upscale alternative to southwestern food. Their flatbrea...", 4.5, 0, false], "23671317": ["Zomato", "AGAVA Restaurant", "May 08, 2015", "Waste of time...... After trying to plan the rehearsal dinner for our wedding at Agava for the past 6 weeks, we finally realized that it's b...", 0, 0, false], "20824807": ["Zomato", "AGAVA Restaurant", "Apr 01, 2014", "It's Meh.. Food is generally decent, except the pizzas, which are really bad. The lamb burger is a solid choice. \r \r The staff and maitre'd ...", 0, 0, false], "20824804": ["Zomato", "AGAVA Restaurant", "Feb 26, 2014", "Very sad. Asked for a table and was told to go to t he bar, as it's full service. was ignored and hostess came up to me and asked if I was e...", 0, 0, false], "27503236": ["Zomato", "Bandwagon Brew Pub", "Jun 29, 2016", "It's quirky location makes it a fun place to discover since its an underground place - only figuratively though. At all times through the we...", 4.5, 0, true], "20824171": ["Zomato", "Bandwagon Brew Pub", "Nov 04, 2012", "Great food and beer.. I can not say enough great things about the Bandwagon. Local food and great home brews. Great portions and a wonderful...", 0, 0, false], "20824168": ["Zomato", "Bandwagon Brew Pub", "Sep 26, 2012", "This Pub Has Potential. My husband and I decided to eat here based on it being a local brew pub that provided local and seasonal foods. I or...", 0, 0, false], "20824165": ["Zomato", "Bandwagon Brew Pub", "May 25, 2012", "Unimpressed ... As a chef if I am going to pay 12.50 for a chicken sandwich it should be something I can't get elsewhere ... This was just s...", 0, 0, false], "20824162": ["Zomato", "Bandwagon Brew Pub", "Jan 19, 2012", "Poor Service. We anticipated our visit as neighbors had enjoyed their visit. We arrived early and were allowed in slightly before 5PM opemin...", 0, 0, false], "27922043": ["Zomato", "Mahogany Grill", "Aug 14, 2016", "Friendly staff and great food! It was super busy while we were  there but service was great!!! Grilled swordfish was done to perfection. Wou...", 4, 0, true], "24721954": ["Zomato", "Mahogany Grill", "Aug 24, 2015", "I have been coming here for years and it has yet to disappoint!We ordered the LA French Toast and the Traditional Eggs Benedict as entrees,C...", 4, 1, true], "20821819": ["Zomato", "Mahogany Grill", "Jun 30, 2014", "Dropped by for lunch and to watch a little World Cup. House burger was great. Sister meal of omelet ok. Nice atmosphere. Relaxed.", 0, 0, false], "20821813": ["Zomato", "Mahogany Grill", "May 15, 2011", "I'm really surprised by the bad reviews and rating here. My wife and I are in town for a wedding and stumbled upon this for dinner. We both ...", 0, 0, false], "20821810": ["Zomato", "Mahogany Grill", "Feb 22, 2011", "Good bar. Menu is too much freezer to fryer. \r \r-----22 Feb, 2011----- \rGood bar. Menu is too much freezer to dryer.", 0, 0, false], "23937718": ["Zomato", "Tamarind", "Jun 09, 2015", "This is a smaller restaurant in Ithaca that when you drive by it always looks closed because it's Dark in the outside and hard to notice the...", 4, 0, true], "20822164": ["Zomato", "Tamarind", "Feb 24, 2014", "Nightmare order. I placed an order with tamarind last night. It arrived 2.5 plus hours after it has placed. It was cold, incomplete, and slo...", 0, 0, false], "20822161": ["Zomato", "Tamarind", "Aug 25, 2013", "Tamarind in Ithaca. I just had one of my worst dining experiences at Tamarind. It took about 45 minutes for our food to arrive while people ...", 0, 0, false], "20822158": ["Zomato", "Tamarind", "Jun 22, 2013", "Best Thai. This was the best Thai I ever had. The coconut soup was outstanding. You can pick your spice level. I suggest to stay on the low ...", 0, 0, false], "20822155": ["Zomato", "Tamarind", "Apr 25, 2013", "Based on the dates of the reviews, no one has been to this place recently. Don't bother. As a matter of fact, stay away. The food is just to...", 0, 0, false], "23938132": ["Zomato", "Sticky Rice", "Jun 09, 2015", "I came to eat here and first had a really hard time time  just finding the place since it was at the back of a building with limited parking...", 1.5, 0, true], "23870608": ["Zomato", "Sticky Rice", "Jun 02, 2015", "Brilliant Vietnamese and Laotian food. Get the stir fry in roast chili paste or any of the curries. And finish off your meal with sticky ric...", 4, 0, false], "20822140": ["Zomato", "Sticky Rice", "Jun 15, 2013", "Most Authentic Thai/Laotian Food. My sister had travelled to Thailand and spent a semester there while she was in College and every time she...", 0, 0, false], "20822137": ["Zomato", "Sticky Rice", "Jan 13, 2013", "I had the Laotian sausage and curry puffs, would def recommend both. If you are ordering takeout, give them extra time. It took about an hou...", 0, 0, false], "20822134": ["Zomato", "Sticky Rice", "Mar 08, 2011", "A (tiny) classic. Small and cozy, a classic for a take out. I also enjoyed to see how many people can actually sit in the few tens of square...", 0, 0, false], "26838776": ["Zomato", "Shortstop Deli", "Apr 18, 2016", "Shady locale and delightful subs are encountered at this deli,while their bread and cold cuts are definitely a step up, it's their oversized...", 4, 0, true], "23937553": ["Zomato", "Shortstop Deli", "Jun 09, 2015", "This is one of the most like sketchy corner places in Ithaca with the cops in the corner there all the time. Lots of homeless people hanging...", 2.5, 0, true], "20822047": ["Zomato", "Shortstop Deli", "Aug 26, 2010", "A special place. When I was taking Driver's Ed in high school, we drove to Shortstop Deli every day of the summer. It became a tradition. I ...", 0, 0, false], "20822044": ["Zomato", "Shortstop Deli", "Jun 13, 2010", "Perfect sandwich!. You can't go wrong with Shortstop Deli. It's like a Sheetz or WaWa... but with MUCH better food, and MUCH bigger portions...", 0, 0, false], "20822041": ["Zomato", "Shortstop Deli", "Mar 27, 2010", "Ithaca Staple. I rarely encounter a person who doesn't like Shortstop. Great food, great selection and I love that the owners still work the...", 0, 0, false], "40902893": ["Zomato", "Viva Cantina", "one month ago", "This place is a return favorite. There are many delicious vegetarian options. This week I had the Calabacitas enchiladas with tomatillo sauc...", 5, 0, false], "24327755": ["Zomato", "Viva Cantina", "Jul 17, 2015", "I love how centrally located this restaurant is. It has a sit down section and a quick eats section, both decorated with lots of colorful ma...", 4.5, 0, false], "23938027": ["Zomato", "Viva Cantina", "Jun 09, 2015", "I keep coming back here because I love their nachos and burritos. They have great Mexican food and it's a fun place to be with outdoor seati...", 5, 0, true], "20822302": ["Zomato", "Viva Cantina", "Apr 26, 2014", "Always head to Viva Cantina after the Flax Barn Sale. Always good, amazing margarita choices, cheap and good as in you can taste the tequila...", 0, 0, false], "20822299": ["Zomato", "Viva Cantina", "Jul 30, 2013", "Our food was ok. There wasnt anything wrong with it. The nachos were excellent. The beef was really good. The rice was also good. The black ...", 3, 0, false], "24993704": ["Zomato", "Cafe Dewitt", "Sep 21, 2015", "In Ithaca for the day and heard of this place from a friend.It's a small place with an even tinier kitchen but don't let that fool you. The ...", 3.5, 0, true], "20821384": ["Zomato", "Cafe Dewitt", "Sep 06, 2014", "Top notch brunch served here. Fresh ingredients, artfully prepared--great bread basket too.\r On a weekend it's pretty crowded and the servic...", 0, 0, false], "20821381": ["Zomato", "Cafe Dewitt", "Jun 01, 2014", "Best brunch in town. Delicious local food. unbeatable quality. try the bread basket on Sundays. you won't be disappointed by any thing you o...", 0, 0, false], "20821378": ["Zomato", "Cafe Dewitt", "Jul 19, 2013", "Go early before crowd hits. On Sundays, be sure to order the bread basket for the tastiest treats to nibble while you wait for your breakfas...", 0, 0, false], "20821375": ["Zomato", "Cafe Dewitt", "Jan 12, 2013", "Best brunch in Ithaca", 0, 0, false], "20821651": ["Zomato", "John Thomas Steakhouse", "Sep 21, 2014", "A bit pricey but excellent service, delicious food, yummy desserts and extremely generous portions. It is worth the price!", 0, 0, false], "20821648": ["Zomato", "John Thomas Steakhouse", "Jan 15, 2013", "Came her with friends from out of them own. I was surprised by the prices. I ordered the prime rib, which was good but felt that it was over...", 0, 0, false], "20821642": ["Zomato", "John Thomas Steakhouse", "Nov 29, 2010", "If you are from big city with great food you will be disappointed but this is one of your best choices in Ithaca. I am from Cali and the ste...", 0, 0, false], "20821639": ["Zomato", "John Thomas Steakhouse", "Apr 23, 2010", "STEAK. Not cheap but the porterhouse steak was great and the service was excellent. no frills but very very good!!!!", 0, 0, false], "20821636": ["Zomato", "John Thomas Steakhouse", "Mar 08, 2010", "Has gone down hill. This, at one time, was my all time favorite place to eat. Over the last year or more, the building has begun to lose it'...", 0, 0, false], "23937526": ["Zomato", "Ciao", "Jun 09, 2015", "The food can be good depending on what you order. This is not the place to go if you want anything healthy, it's more of a \"fun\" to go to pl...", 3.5, 0, true], "23454647": ["Zomato", "Ciao", "Apr 08, 2015", "We have enjoyed good food, pleasant servers, and a vibrant atmosphere every time we have been here. Something on the menu for all ages. It's...", 0, 0, false], "20824372": ["Zomato", "Ciao", "Sep 27, 2014", "Underwhelming Chain Vibe.. Gluten free pasta dish I ordered wasn't bad but lacked authenticity. Waitress wasn't very helpful when I asked if...", 0, 0, false], "20824369": ["Zomato", "Ciao", "Apr 18, 2014", "Very disappointed. I must be in the minority, but my fiance and I were underwhelmed by our dinner tonight. After leaving our names upon arri...", 0, 1, false], "20824366": ["Zomato", "Ciao", "Mar 15, 2013", "+ side salad is under $3! Awesome!\r - fountain soda $3. For real?!?\r + pizza is tasty\r - leftover pizza...I'd rather eat the box it was pack...", 0, 0, false], "35062545": ["Zomato", "Five Guys Burgers and Fries", "9 months ago", "Best fast burger in Ithaca! Fresh cut fries. Incredible choice of toppings, too. Food made to order. Love their app, most fast food apps sti...", 5, 0, false], "20823688": ["Zomato", "Five Guys Burgers and Fries", "May 27, 2014", "Always A Winner!!. Five Guys Burgers are some of the best out there, and this location is no different. Amazing burgers and a generous porti...", 5, 1, false], "20823685": ["Zomato", "Five Guys Burgers and Fries", "Jan 11, 2014", "Not all that. More a question of ambiance: really dirty tables & floor, non-functioning clock, bad music playing too loudly. Servers were OK...", 0, 0, false], "20823682": ["Zomato", "Five Guys Burgers and Fries", "Jul 31, 2012", "What can I say!. 5 guys has got to be the best damn burger around bar none! So simple yet just perfect. This 5 guys has a staff that just se...", 0, 2, true], "20823679": ["Zomato", "Five Guys Burgers and Fries", "Aug 26, 2010", "Even I love this place. And I'm a vegetarian! When the rest of the gang wants to come I'm on board, their veggie sandwich is melty and good....", 0, 0, false], "23937622": ["Zomato", "NorthStar House", "Jun 09, 2015", "This place was expensive so I expected the food quality and table service to be great, but ended up not eating my dish as there was little f...", 2, 0, true], "20824048": ["Zomato", "NorthStar House", "Jun 30, 2014", "Meh. My husband and I got take-out to try out the food. We enjoyed the burger, after my husband microwaved it to finish the cooking! I had t...", 0, 0, false], "20824045": ["Zomato", "NorthStar House", "Jun 30, 2014", "Everything is tasty. So good. Was last here a year ago, did not disappoint. Tofu wings are so damn tasty! Cauliflower dip was surprisingly g...", 0, 0, false], "20824042": ["Zomato", "NorthStar House", "Feb 28, 2014", "This restaurant will ban you from future service if you complain!. My friend Christina and I made Northstar House our weekly hang out spot f...", 0, 0, false], "20824039": ["Zomato", "NorthStar House", "Feb 16, 2014", "We waited 30 minutes before we got our order. The wait staff was inefficient. I admit this is a personal thing: the staff wore everything fr...", 0, 0, false], "25083622": ["Zomato", "Waffle Frolic", "Sep 30, 2015", "When in Ithaca,going to the Commons is a must and going to Waffle Frolic is even more necessary.Who doesn't love breakfast sandwiches,desser...", 4, 1, true], "20824111": ["Zomato", "Waffle Frolic", "Nov 18, 2013", "Terrific lunch and great with Gluten-free items!. Last weekend we enjoyed a terrific lunch at the Waffle Frolic. We had two adults and three...", 0, 0, false], "20824108": ["Zomato", "Waffle Frolic", "Jun 29, 2013", "Nice selection of Waffles. For a quick and unique bite this is a nice place to eat. The waffles are the highlight, as should be expected. Go...", 0, 0, false], "20824105": ["Zomato", "Waffle Frolic", "Jan 12, 2013", "Pretty darn good waffle, as far as gluten-free goes! No weird taste or texture as with many GF quick breads. They were a little stingy with ...", 0, 0, false], "20824102": ["Zomato", "Waffle Frolic", "Jul 24, 2012", "After hearing my coworkers rave about Waffle Frolic since it opened, I finally checked it out. I orded a waffle without any toppings, and af...", 0, 0, false], "40902927": ["Zomato", "Gimme Coffee", "one month ago", "The coffee here is top notch. Service is friendly. There is a great selection of both sweet and savory pastries from Krumb and I can’t res...", 5, 0, false], "20821492": ["Zomato", "Gimme Coffee", "Jun 24, 2013", "They have really good coffee, nice staff and very good atmosphere for studying.", 0, 0, false], "20821489": ["Zomato", "Gimme Coffee", "Mar 08, 2011", "Where lifes crosses. Nowhere have I randomly run into people as consistently as at Gimme. It is just the attractive center of gravity of Ith...", 0, 0, false], "20821486": ["Zomato", "Gimme Coffee", "Dec 04, 2010", "Bad espresso. I'm an espresso drinker and I have drank espresso all over the world and I can say that Gimme serves the worst espresso i have...", 0, 0, false], "25754357": ["Zomato", "Heights Café & Grill", "Dec 16, 2015", "Expensive, snooty litlle cafe with crappy service but good food!", 3, 0, true], "23938056": ["Zomato", "Heights Café & Grill", "Jun 09, 2015", "Classy and well trained waiters. In a more upscale part of Ithaca in corners community. They have small portions so you will need to order a...", 5, 0, true], "20821540": ["Zomato", "Heights Café & Grill", "Sep 09, 2012", "Not particurly happy. My BF's from my wedding met for lunch , they were happy, however the glass of wine that I was served had lipstick mark...", 0, 0, false], "20821537": ["Zomato", "Heights Café & Grill", "May 29, 2011", "Snobby and slow. It was lunch time and there were few people there but the hostess still asked us if we had a reservation, weird. The waiter...", 0, 0, true], "20821534": ["Zomato", "Heights Café & Grill", "May 09, 2011", "The most amazing burger I have ever tasted!!! Expensive to say the least at $19 for a hamburger, but I can honestly say it was well worth it...", 0, 0, false], "24684130": ["Zomato", "Kilpatrick's Publick House", "Aug 21, 2015", "It has been a week since I have visited this place. Kilpatricks was my first taste of restaurant food in Ithaca after moving here from India...", 4, 0, true], "20824324": ["Zomato", "Kilpatrick's Publick House", "Feb 08, 2015", "So disappointed. The pub itself was pretty cool, especially the booths in the back but the food was disgusting. Everything tasted processed ...", 0, 0, false], "20824321": ["Zomato", "Kilpatrick's Publick House", "May 17, 2013", "Easy pub food. We enjoyed veggie burgers which can be prepared in any of the burger options. Waiter super nice.", 0, 0, false], "20824318": ["Zomato", "Kilpatrick's Publick House", "Mar 02, 2013", "Husband's burger was good, but my grilled cheese was yucky, cold, and disappointing. Waitress was nice, but the service was bad (bad coffee,...", 0, 0, false], "20824315": ["Zomato", "Kilpatrick's Publick House", "Jun 01, 2012", "I'm always Irish when I eat at Kilpatrick's. They have a brie appetizer that's a favorite. I love to sit in the wood booths, always makes me...", 0, 0, false], "27503159": ["Zomato", "Saigon Kitchen", "Jun 29, 2016", "In this small college town of Ithaca, Saigon Kitchen is an oasis of Asian food made better with a strong Vietnamese character at this small ...", 4.5, 0, true], "25818451": ["Zomato", "Saigon Kitchen", "Dec 24, 2015", "The Pho is absolutely delicious!!! The service is wonderful. The portion size is amazing and generous. It is a fabulous restaurant in Ithaca...", 5, 1, false], "20824750": ["Zomato", "Saigon Kitchen", "Sep 08, 2012", "I went here last night for the first time and was blown away by the flavor of the dishes!! Amazing food!! I'll recommend to anyone", 0, 0, false], "20824747": ["Zomato", "Saigon Kitchen", "Jul 25, 2012", "Ate from their vendor stand and it was really good for festival food. Would love to go to the restaurant - I bet it would great.", 0, 0, false], "20824744": ["Zomato", "Saigon Kitchen", "Jul 08, 2012", "Friendly, with particularly good appetizers!. We recently visited with our young son, and enjoyed a very warm welcome. We found the appetize...", 0, 0, true], "35019824": ["Zomato", "Souvlaki House", "9 months ago", "The Souvlaki House is an Eddy Street tradition for over 40 years.  Souvlaki House has delicious  tasting Greek food, but it has more than G...", 5, 0, true], "20822083": ["Zomato", "Souvlaki House", "Sep 14, 2014", "Awesome.. Ice cold water as soon as you sit down.", 0, 0, false], "20822080": ["Zomato", "Souvlaki House", "Jan 12, 2013", "It was good. Love their family style salad. The service was lackluster, so don't go if you expect someone to be nice to you!", 0, 1, false], "20822077": ["Zomato", "Souvlaki House", "Aug 14, 2011", "This is a family favorite. There are great calzones, spinakopita, souvlaki, euros, and garlic bread. No atmosphere, but the same guy has run...", 0, 0, false], "20822074": ["Zomato", "Souvlaki House", "Dec 04, 2009", "Great food! I've been going there for years and the food has stayed as delicious as the first time I remember going there! The greek salad a...", 0, 0, false], "23938041": ["Zomato", "Aladdins Natural Eatery", "Jun 09, 2015", "I love this place but whenever I go there end up with a large bill between the appetizers, meal, coffee and desert it's not cheap considerin...", 5, 0, true], "20821228": ["Zomato", "Aladdins Natural Eatery", "Mar 17, 2013", "We met some friends there that recommended it and I was pleasantly surprised how good it was. Great prices for the amount of food. Had a won...", 0, 0, false], "20821225": ["Zomato", "Aladdins Natural Eatery", "Jul 31, 2012", "Great place! Wonderful menu. Eat in, take out and catering. Outside eating area. Air conditioning inside. Very tasty food. Clean restaurant....", 0, 0, false], "20821222": ["Zomato", "Aladdins Natural Eatery", "Sep 13, 2011", "Even my picky vegan friend ate all her food!. I'm not a vegan/vegetarian or ever plan to be, so I was skeptical at first, but my meal was ou...", 0, 0, true], "20821219": ["Zomato", "Aladdins Natural Eatery", "Aug 31, 2009", "Reliably good food at reasonable prices. You can easily eat dinner here for under $10 if you are so inclined. Lots of excellent pitas, large...", 0, 0, false], "27218119": ["Zomato", "State Diner of Ithaca", "May 30, 2016", "This review is based of the tasting of just their apple pie. But it deserves one. Because the apple pie was delicious. The pie crust was but...", 3.5, 0, true], "20822095": ["Zomato", "State Diner of Ithaca", "Jun 15, 2014", "Great food! Georgia very friendly.", 0, 0, false], "20822092": ["Zomato", "State Diner of Ithaca", "Jul 26, 2013", "You gotta check this place out!. The only way you can decide is to go for yourself. Order all your favorite diner foods and comment as you s...", 0, 1, false], "20822089": ["Zomato", "State Diner of Ithaca", "Oct 15, 2010", "Overpriced. Good, typical diner fare. But way overpriced for a diner. There are many better out there.", 0, 0, true], "20822086": ["Zomato", "State Diner of Ithaca", "Jul 17, 2009", "Deliciously American!", 0, 0, false], "24552211": ["Zomato", "Antlers", "Aug 08, 2015", "Been eating at Antlers for 26 years. One of my local favorites. Not cheap, but there are specials every night. Wonderful atmosphere, good se...", 5, 0, false], "20821240": ["Zomato", "Antlers", "Mar 20, 2011", "Don't believe the hype. After checking out the reviews here I was looking forward to having dinner at Antlers. When my date and I arrived th...", 0, 0, false], "20821237": ["Zomato", "Antlers", "Apr 02, 2010", "Good food, good atmospher, great service.", 0, 1, true], "20821234": ["Zomato", "Antlers", "Jan 03, 2010", "Great cocktails for half the price. Try the fruit 66 martini and you'll swear that it's the same drink you had at ZaZa's! Really nice home-c...", 0, 0, false], "20821231": ["Zomato", "Antlers", "Apr 06, 2009", "Nice Down Home Restaurant. The Antlers is very pleasurable dining indeed. I can't say that the food is the most elegant ever. But it is a gr...", 0, 0, false], "20821864": ["Zomato", "The Mate' Factor Cafe & Juice Bar", "Nov 04, 2014", "Who know. Wanted a lite lunch down town and wandered into this place. \r Amazing natural wood decor in am old building. Seemed like a serious...", 0, 0, true], "20821861": ["Zomato", "The Mate' Factor Cafe & Juice Bar", "Jun 03, 2014", "Best roast beef sandwich I've ever had. Strawberry smoothie equally as good!", 0, 0, false], "20821858": ["Zomato", "The Mate' Factor Cafe & Juice Bar", "Apr 19, 2013", "This place is not worth the $$ you spend and apparently it's run by a cult. Our food took much to long and it sat on the counter while count...", 0, 0, false], "20821855": ["Zomato", "The Mate' Factor Cafe & Juice Bar", "Dec 28, 2011", "Mate latte (Ithaca roast) is like mana from heaven, served by a bearded lunatic who specializes in bird calls. real fire with real wood. gre...", 0, 0, false], "20821852": ["Zomato", "The Mate' Factor Cafe & Juice Bar", "Nov 14, 2010", "Fish Chowder Fridays! Dang! Beautiful vibe generally. Pretty great at making esspresso too. Definitely part of a Commons revitalization.", 0, 0, false], "20821426": ["Zomato", "Collegetown Bagels", "Jun 13, 2010", "Bagels and More. As the name of the restaurant implies, they have great bagels.\r \r But it's oh so much more. The sandwich and breakfast menu...", 0, 0, false], "34851052": ["Zomato", "Mehak: Authentic Indian Cuisine", "10 months ago", "This place has left a mark on my stomach and heart. The food was soo good. The chat was nice and crispy the way I liked it. Also ordered cha...", 4, 0, true], "29348024": ["Zomato", "Mehak: Authentic Indian Cuisine", "Jan 29, 2017", "I usually go for lunch, which is also when they serve their very popular buffet. I like the buffet, both quality and taste are very good and...", 4, 0, false], "24327791": ["Zomato", "Mehak: Authentic Indian Cuisine", "Jul 17, 2015", "Their lunch buffet is a great bang for your buck. Lots of choices that are all fantastic. Their dinner portions are large enough for leftove...", 4.5, 0, false], "23937918": ["Zomato", "Mehak: Authentic Indian Cuisine", "Jun 09, 2015", "Great restaurant located in college town of cornell right next door practically to another Indian restaurant. This restaurant feels a bit cl...", 5, 0, true], "20824312": ["Zomato", "Mehak: Authentic Indian Cuisine", "Aug 15, 2012", "Tender lamb. I got the Kahrabi lamb that wasn't too spicy. The lamb just fell apart perfectly. Will be back again sometime!", 0, 0, true], "27032539": ["Zomato", "Buffalo Wild Wings", "May 10, 2016", "My husband and I went here for lunch today and despite all the negative reviews,we really enjoyed our visit. We both ordered small orders of...", 4.5, 0, false], "20824141": ["Zomato", "Buffalo Wild Wings", "Oct 14, 2012", "Food was lousy (small wings, soggy flatbread), beer was flat (we tried 2 different on tap) & I had to request: water, napkins & blue cheese ...", 0, 0, false], "20824138": ["Zomato", "Buffalo Wild Wings", "Mar 05, 2011", "Worst Wild Wings Ever!. I actually like Buffalo Wild Wings. I have been to a number of locations and for the most part have had a pleasant e...", 0, 1, false], "20824135": ["Zomato", "Buffalo Wild Wings", "Dec 12, 2010", "Terrible. Went there hoping to get some wings & watch the game. Waited over 15 minutes, with no acknowledgment from a server. Ended up walki...", 0, 1, false], "20824132": ["Zomato", "Buffalo Wild Wings", "Nov 29, 2010", "I love buffalo wild wings but the location in Ithaca, Ny is horrible waited over 20 minutes and never even seen our waiter and the place onl...", 0, 1, false], "23937768": ["Zomato", "D. P. Dough", "Jun 09, 2015", "open late night. This is one of those places you would rather order delivery from then even know where your food comes from. I have no idea ...", 2.5, 0, true], "20821468": ["Zomato", "D. P. Dough", "Sep 09, 2012", "Love the food, clean the kitchen!. I have eaten entirely to many dp dough calzones in my time and enjoyed everyone! I made the mistake last ...", 0, 0, false], "20821465": ["Zomato", "D. P. Dough", "Aug 23, 2010", "Mad good calzones yo !!!!!!!!!!!", 0, 1, false], "34851025": ["Zomato", "New Delhi Diamond's Restaurant", "10 months ago", "The place is okay. Wasn't too exciting and the food was okay. Had a Punjabi parantha and a samosa chat. Was okay to fill our stomach... Not ...", 2, 0, true], "23937933": ["Zomato", "New Delhi Diamond's Restaurant", "Jun 09, 2015", "I love this restaurants when I am downtown and hungry. The food is delicious and some of my friends who are Indian claim it's very authentic...", 5, 0, true], "20821954": ["Zomato", "New Delhi Diamond's Restaurant", "May 26, 2012", "This is without a doubt some.... This is without a doubt one of the best Indian restaurants I have been. I ordered the chicken tikka masala ...", 0, 0, false], "23937804": ["Zomato", "Joe's Restaurant", "Jun 09, 2015", "sadly this used to be my favorite restaurant in Ithaca before it went downhill after changing owners. The bar is still beautiful and you get...", 2.5, 0, true], "20821630": ["Zomato", "Joe's Restaurant", "Jun 13, 2010", "Glad they're back!. I first experienced Joe's in 2000 when it quickly became one of my favorite restaurants in Ithaca. It went downhill for ...", 0, 1, false], "20821627": ["Zomato", "Joe's Restaurant", "Feb 10, 2010", "Poor atmosphere, the menu, the salad and the bread all smacked of a gain restaurant in taste and quality. Dissappointing", 0, 0, false], "37926575": ["Zomato", "Mercato Bar & Kitchen", "6 months ago", "good food, but the portions are a little small. the service was also good, and the price was alright. overall it was a good meal, the highli...", 4, 0, false], "20824417": ["Zomato", "Mercato Bar & Kitchen", "Jun 21, 2013", "Top notch...if yor loping for Italian American Oversized Portions this isn't for you...go get your fill of salad and pasta at Olive Garden. ...", 0, 0, false], "20824414": ["Zomato", "Mercato Bar & Kitchen", "Jun 30, 2012", "The meal was good, unfortunately, the waitress misplaced some of the cash from the tray. She came back and told us that we did not pay enoug...", 0, 0, false], "20824411": ["Zomato", "Mercato Bar & Kitchen", "Jul 14, 2011", "Over-rated & Over-Priced. After hearing many rave reviews of Mercato, I found this restaurant all in all, disappointing. The ambiance was ni...", 0, 0, false], "20822017": ["Zomato", "Rulloff's Restaurant", "Feb 15, 2010", "Best burgers and fries in town! Try the Spinach and Artichoke dip-it's a real crowd pleaser. Decent beer prices for pitchers and try the Whi...", 0, 0, false], "20822014": ["Zomato", "Rulloff's Restaurant", "Jun 02, 2009", "Good burgers, good fries, horrible ceasar salad, horrible muscles", 0, 0, false], "20821258": ["Zomato", "Asia Cuisine", "Jan 26, 2015", "Dependably good food. One of the best restaurants downtown, the kind of place you crave when feeling a little under-the-weather. Korean food...", 0, 0, false], "20821255": ["Zomato", "Asia Cuisine", "Feb 16, 2014", "Best Korean and Korean style Chinese restaurant in Ithaca. Some of my friends at Cornell often ask me if there is any good Korean restaurant...", 0, 0, false], "20821252": ["Zomato", "Asia Cuisine", "Aug 03, 2013", "I was hoping for a really good meal here. It was a 4/10 for me. \r Good: friendly & fast service. Vegetarian entrees like Tofu & Broccoli\r Ba...", 0, 0, false], "20821249": ["Zomato", "Asia Cuisine", "Dec 28, 2011", "Looks a little dumpy from the outside but WOW they can fry some tofu! great lunch special. try the sesame tofu you won't regret it", 0, 0, false], "28402901": ["Zomato", "Coltivare", "Oct 05, 2016", "My husband and I had a reservation at Coltivare  Restaurant.  We arrived on time and was seated. We waited for awhile, a waiter never came t...", 1, 0, false], "24596703": ["Zomato", "Coltivare", "Aug 12, 2015", "This place has so much potential, but is so horrible. The portions are TINY. Way too expensive for bland food that is trying to be fancy. St...", 1, 1, false], "23454657": ["Zomato", "Coltivare", "Mar 05, 2015", "I don't know what earlier reviewers didn't like... We had really great service, even with a big group, and they didn't even need to be asked...", 0, 0, false], "20825149": ["Zomato", "Coltivare", "Mar 16, 2015", "No value. Very small portions elegantly presented. If expensive pretty food is what you want, then you'll be happy.", 0, 0, true], "23928695": ["Zomato", "Sumo Japanese Restaurant", "Jun 08, 2015", "I really love this place and take my guests visiting Ithaca here when they come. It always feels clean and spotless when you eat there. The ...", 5, 0, true], "20824975": ["Zomato", "Sumo Japanese Restaurant", "Oct 16, 2013", "So long and thanks for all the fish!. Sumo is my #1 go-to sushi house in Ithaca. I enjoy simple and fresh sashimi. Their fresh standards and...", 0, 0, false], "20824972": ["Zomato", "Sumo Japanese Restaurant", "Sep 22, 2013", "Very nice restaurant BUT! EVERY TIME we've been (5 times now ) WITH reservations we have had to wait at least an hour to be seated. They nee...", 0, 0, true], "20824969": ["Zomato", "Sumo Japanese Restaurant", "Jul 28, 2013", "Best japanese restaurant in the town. Sushi are very fresh. Staffs are friendly. \r \r-----12 Apr, 2013----- \rBest Sushi in Ithaca. Price so r...", 0, 0, false], "29326493": ["Zomato", "Gorgers", "Jan 27, 2017", "I had the mushroom and Swiss and it was outstanding. Steak was real, tender steak pieces.  Come hungry - the sub is huge and a great value f...", 4.5, 0, false], "20824966": ["Zomato", "Gorgers", "Jul 19, 2014", "Philly Supreme. THE ONLY CHEESE STEAK IN ITHACA WORTH ORDERING  I love Gorgers!", 0, 0, false], "20824963": ["Zomato", "Gorgers", "Sep 30, 2012", "Gorgers has possibly the friendliest service I have EVER experienced. I came in there for the first time on Friday; it was a cold and rainy ...", 0, 0, false], "20823442": ["Zomato", "Cornell Dairy Bar", "Aug 26, 2010", "Holy cow!. Fresh, locally made ice cream. What's not to love?", 0, 1, false], "23937987": ["Zomato", "Mia", "Jun 09, 2015", "A super classy romantic restaurant with a beautiful bar and dinner seating too. They are clean and the inside is gorgeous. The waiters were ...", 5, 0, true], "20824762": ["Zomato", "Mia", "Aug 03, 2014", "Dining with a family of picky eaters can be hard... But not here! We had summer rolls, soup, rice, noodles, fish, fried tofu, ramen, and tas...", 0, 0, false], "20824759": ["Zomato", "Mia", "Aug 03, 2014", "Truly Excellent Meal. Tasty and unusual Asian tapas. Had four different ones, all we're excellent and definitely not something you would mak...", 0, 0, false], "20824756": ["Zomato", "Mia", "Sep 05, 2013", "I wish I could go back!. I visited Mia forever ago and wish I could recreate their curry- red snapper dish!", 0, 0, false], "20824753": ["Zomato", "Mia", "Aug 23, 2012", "Quite delicious. The Mia pork buns are to die for.", 0, 0, false], "20822347": ["Zomato", "Wegmans Food Pharmacy", "Feb 11, 2011", "Best grocery store ever!!. I used to live in Ithaca for three years for my graduate school. It was probably the toughest three years of my l...", 0, 1, true], "29578611": ["Zomato", "Hai Hong Restaurant", "Feb 24, 2017", "Saw that this restaurant had good reviews so we tried it out. It was not very good. It didn't taste like your typical Chinese food. It taste...", 1, 0, false], "20821519": ["Zomato", "Hai Hong Restaurant", "Feb 19, 2012", "Variable quality. This used to be the best Chinese food in Ithaca. Now the quality of the food is questionable.", 0, 0, false], "20821516": ["Zomato", "Hai Hong Restaurant", "Nov 22, 2011", "This place is awful (and a rip-off). We ordered two dishes and one side for take out. It was $50 bucks. What???? Then, one of the main dishe...", 0, 0, false], "20823997": ["Zomato", "Sweet Melissa's Ice Cream Shop", "Jul 10, 2010", "Great Flavor. If you like tangy ice cream get the Two Flavor Berry Twist. I could eat it for every meal!!", 0, 0, false], "20823994": ["Zomato", "Sweet Melissa's Ice Cream Shop", "Apr 11, 2010", "Great Ice Cream. Super cute ice cream place with really great soft serve ice cream! Very kid friendly and they have a lot of options.", 0, 0, false], "20823991": ["Zomato", "Sweet Melissa's Ice Cream Shop", "Mar 30, 2010", "SO SWEET! :). Sweet Melissa's is such a cute ice cream shop located right in the heart of Ithaca! They have great customer service and the o...", 0, 0, false], "29721840": ["Zomato", "Red's Place", "Mar 11, 2017", "Super cool environment and good service with an interesting menu. They have many beers and a great teas selection. I recommend the pbj burge...", 4, 0, true], "26511751": ["Zomato", "Red's Place", "Mar 12, 2016", "1st visit and my husband and I loved Red's. The loaded tots are delicious!!! We had the Little bo peep lamb burger and their Irishman Burger...", 4.5, 0, false], "20825122": ["Zomato", "Red's Place", "Nov 03, 2014", "Great Potential, Leaves a lot to be Desired. From the caliber and efficiency of service to the general ambiance, this place is in dire need ...", 0, 0, false], "20824393": ["Zomato", "Sahara", "Mar 02, 2013", "Hummus good. Service subpar. Friends ordered salads. I ordered swordfish. Friend's soup came out staggered alone from appetizers. Salads cam...", 0, 0, false], "20824390": ["Zomato", "Sahara", "Jul 11, 2011", "Don't go.... The spanikopita was much worse than I can make myself, and I am not a seasoned Greek chef. The hummus and pita was good, but th...", 0, 0, false], "20824387": ["Zomato", "Sahara", "Jul 06, 2011", "Boring. bland.. I had high hopes going here, especially since Sinbad's closure, and given the anemic nature of Aladdin's in Collegetown. I h...", 0, 0, false], "20821975": ["Zomato", "Plum Tree Japanese Restaurant", "May 24, 2009", "Plum. The first place i ever had sushi... I was very happy I dared to. Delicious!\r \r everything was good, even the seaweed salad. Good servi...", 0, 0, true], "20822290": ["Zomato", "Vietnam Restaurant", "Nov 29, 2009", "One of My Favorites. I've never been to Vietnam (the country!), so I can't comment on the restaurant's authenticity, but I can say that ever...", 0, 0, false], "20822287": ["Zomato", "Vietnam Restaurant", "Jun 02, 2009", "Barely resembles Vietnamese food. Before you even enter the building you can tell from looking into the windows that it's not an authentic V...", 0, 1, false], "20822356": ["Zomato", "Wings Over Ithaca", "Sep 22, 2013", "Good wings, lousy atmosphere. Plain, open, flourescent light linoleum \"gymnasium\" room to eat in. Blah!", 0, 0, true], "20822353": ["Zomato", "Wings Over Ithaca", "Oct 22, 2009", "Good wings, bad service. The wings here are good, I can't deny it, and that's what keeps me going back in spite of the fact that this restau...", 0, 0, false], "20822350": ["Zomato", "Wings Over Ithaca", "Jun 02, 2009", "Good Chicken, plenty of napkins, free soda refills.", 0, 0, false], "20821261": ["Zomato", "Banfi's Restaurant", "Jan 28, 2014", "Desserts: perfection.. The soup & salad meal here is exquisite, and priced accordingly. The soups are always top-notch even if their names a...", 0, 0, false], "23937851": ["Zomato", "Napoli Pizzeria", "Jun 09, 2015", "Pretty good pizza, it's better quality than dominos next door to them. Their gluten free pizza was very pricey and didn't taste good, but th...", 3, 0, true], "25943559": ["Zomato", "Dolce Delight", "Jan 07, 2016", "My friends and I eat lunch here every week. A fabulous place, though sometimes busy. Homemade soups and sandwiches, lattes, salads and they ...", 5, 0, false], "24483317": ["Zomato", "Dolce Delight", "Aug 01, 2015", "Some of the best peach blueberry pie I've ever had! Beware that though listed as open until 7PM, they close at 6PM. The weather was great so...", 4.5, 0, false], "20823478": ["Zomato", "Dolce Delight", "Feb 14, 2011", "The best homemade desserts in Ithaca.... Finally found a place that makes homemade pies from scratch... Yummy!!!", 0, 0, false], "20823475": ["Zomato", "Dolce Delight", "Aug 05, 2009", "Oh my..... Goose Tracks think Moose Tracks....mmmm!", 0, 0, false], "29446758": ["Zomato", "Tokyo Hibachi", "Feb 10, 2017", "Tokyo has amazing sushi and even more amazing service! They have started an all you can eat menu and it includes the kitchen and sushi bar! ...", 5, 1, false], "23937844": ["Zomato", "Pizza Aroma", "Jun 09, 2015", "Some of the best pizza you can get when you are downtown. They have an amazing crust and lots of unique topping combos. This is my number 1 ...", 5, 0, true], "20821972": ["Zomato", "Pizza Aroma", "Aug 08, 2010", "Excellent &creative pizzas: from cheese to BBQ chicken", 0, 0, false], "20821396": ["Zomato", "Capital Corner", "Jun 01, 2012", "Quite possibly the best quality-to-value ratio I've ever encountered in Ithaca. A mere $6 gets you, for example, a huge plate of succulent, ...", 0, 0, false], "20821393": ["Zomato", "Capital Corner", "Mar 04, 2011", "Best Chinese food in Ithaca. Friendly family-service, great eel, shrimp with broccoli, and the lo mein is not greasy", 0, 0, false], "20821390": ["Zomato", "Capital Corner", "Mar 26, 2010", "GREAT CHINESE FOOD. Very affordably priced and in a great location, this restaurant offers a wide variety of chinese food served in a very p...", 0, 0, false], "20821387": ["Zomato", "Capital Corner", "Jan 02, 2010", "Awful experiences!!. With a good location and generally fine atmosphere but kind of pricy\r its food is sooo terrible--worst ever i've had, e...", 0, 0, false], "24883517": ["Zomato", "Thai Basil Restaurant", "Sep 10, 2015", "it has been new owner and new menu at ithacathaibasil come and try thai food", 5, 0, false], "20824939": ["Zomato", "Thai Basil Restaurant", "Nov 18, 2012", "Great food! Very attentive service!. I love really good food, so I am always excited but skeptical when trying new places. I have walked by ...", 0, 0, false], "20824936": ["Zomato", "Thai Basil Restaurant", "Aug 08, 2012", "In a city as packed with Thai restaurants as Ithaca, I'm happy to say that the newly opened Bangkok Thai Bistro is one of the better ones. I...", 0, 0, false], "39010133": ["Zomato", "Sangam Indian Cuisine", "5 months ago", "This is one of the best Indian restaurants in ithaca. I love the food and ambience. Buffet at lunch is the best 😍 Being a foodie, I enjoy...", 4, 0, false], "23937895": ["Zomato", "Sangam Indian Cuisine", "Jun 09, 2015", "One of my favorite things about Ithaca is all the fabulous places to eat and Sangam is one of them. They are located in the heart of college...", 5, 0, true], "20822029": ["Zomato", "Sangam Indian Cuisine", "Mar 08, 2013", "Sangam has the best Indian cuisine in Ithaca, high quality traditional Indian food made authentically. The staff here are excellent, kind an...", 0, 1, false], "23937828": ["Zomato", "Northeast Pizza", "Jun 09, 2015", "This was my least favorite pizza place in Ithaca. I ordered a slice of cheese pizza and it felt like they sold me something a week old with ...", 2, 0, true], "20824495": ["Zomato", "Northeast Pizza", "Jan 07, 2014", "I will never eat there again! Order was called in bcuz they don't deliver where I live. When I went to pick it up, I noticed the young man m...", 0, 0, false], "20824492": ["Zomato", "Northeast Pizza", "Jul 12, 2013", "Good NY pizza, good beer, and a guy playing cat Stevens on the guitar. What's not to like. Two thumbs up!", 0, 0, false], "20824489": ["Zomato", "Northeast Pizza", "Jul 25, 2012", "Very good ! A group of 16 of us walked in they sat us right away!! Pizza and wings were awesome !! Glad we found this place.", 0, 0, false], "20824486": ["Zomato", "Northeast Pizza", "May 25, 2012", "Just had the margaretta pizza, fresh mozzarella with a thin crust= amazing!!", 0, 0, false], "24327831": ["Zomato", "Asian Noodle House", "Jul 17, 2015", "Great for a quick takeout bite. The curry is especially good. The actual restaurant doesn't look so nice so I don't like to eat in, but most...", 3.5, 0, false], "23937596": ["Zomato", "Ned's Pizza", "Jun 09, 2015", "This has to be one of the best small pizza places in Ithaca for their New York style pizza. They fixed it up with fancier chairs and tables ...", 5, 0, true], "20821951": ["Zomato", "Ned's Pizza", "Nov 04, 2011", "Great Pizza!. Ned's is my favorite place in Ithaca for traditional New York style thin crust pizza. Can't beat a couple cheese or pepperoni ...", 0, 0, false], "25990949": ["Zomato", "Istanbul Turkish Kitchen", "Jan 13, 2016", "We went with a group of friends and ordered different entrees to try. Of all the choices, I loved the sebze kebab (pic not attached) the bes...", 3.5, 0, true], "23454653": ["Zomato", "Istanbul Turkish Kitchen", "Apr 05, 2015", "Loved it. Took a party of six there tonight and had a variety of appetizers, main dishes and desserts. All were delicious. Donar Kebab was s...", 0, 0, false], "20825131": ["Zomato", "Istanbul Turkish Kitchen", "Dec 14, 2014", "This place is a fantastic addition to the Ithaca restaurant community. I've eaten here three times so far and had three different entrees, a...", 0, 0, false], "20822023": ["Zomato", "Sammy's Pizzeria & Restaurant", "Apr 21, 2009", "Pizza Pizza!. Made me remember i was still in New York... good pizza with a crisp bottom crust.", 0, 0, true], "24848169": ["Zomato", "Kelly's Dock-Side Cafe", "Sep 06, 2015", "Was passing through Ithaca today and chose Kelly's over some other \"higher rated\" breakfast spots because it's on the water.  The food is fi...", 3.5, 0, false], "20821714": ["Zomato", "Kelly's Dock-Side Cafe", "Sep 08, 2014", "This is the worst restaurant I have ever been to. As we walked out to the patio we interrupted two folks smoking pot. Things never got back ...", 0, 0, true], "20821711": ["Zomato", "Kelly's Dock-Side Cafe", "Oct 15, 2010", "Can't beat Saturday special. All you can eat snow crab legs on Saturday for approx. $20. Just call ahead to make a reservation.", 0, 0, true], "20821543": ["Zomato", "Hot Truck", "Feb 03, 2012", "First of the Food Trucks.... Well, almost. \r \r Hubby has very fond memories of his time at Cornell and this truck was a pretty big part of t...", 0, 1, false], "25022328": ["Zomato", "Ithaca Beer Company", "Sep 24, 2015", "Ithaca Beer is a fantastic place to get a meal. Fresh, local food served with locally brewed beer, liquor from Finger Lakes distilleries... ...", 4.5, 0, false], "24327772": ["Zomato", "Ithaca Beer Company", "Jul 17, 2015", "Always crowded. The fries and burgers are to die for! They have interesting specials and seasonal beers on tap. You can see the brewing tank...", 4.5, 0, false], "20825065": ["Zomato", "Ithaca Beer Company", "Jun 15, 2014", "The beer and food is a must have! Fantastic beer tour by Eric, topped off with Excellent service from Anna.", 0, 0, false], "24278708": ["Zomato", "Friendly's", "Jul 13, 2015", "Great ice cream!!!  Horrible food, all fatty, junk food with no nutritional value-empty calories. The kitchen and dining area never looked t...", 2.5, 0, true], "20821483": ["Zomato", "Friendly's", "Sep 15, 2012", "I've been waiting for 20 minutes and haven't received any sort of assistance aside from being seated and that took a while too. I haven't ev...", 0, 0, false], "20821246": ["Zomato", "Apollo Restaurant", "Dec 28, 2013", "Try the crispy beef (not available on the online menu, but is on the printed menu). We got it by accident one night and now it's a favorite....", 0, 0, false], "20821243": ["Zomato", "Apollo Restaurant", "May 31, 2012", "Not at all what I was expecting. The first time I came in I ordered sweet and sour chicken, and what I got was something akin to Chicken McN...", 0, 0, false], "20823907": ["Zomato", "Moe's Southwest Grill", "Jul 28, 2013", "Decent food. Well, it was very filling. I had the nachos and you could get any or all of the free toppings on them. The taste was good and t...", 0, 0, false], "20823904": ["Zomato", "Moe's Southwest Grill", "Aug 26, 2010", "Decent burrito chain. Chipotle is still my favorite hands down, but there isn't one in Ithaca and my son loves to come here and well, what's...", 0, 0, false], "23937584": ["Zomato", "Papa John's Pizza", "Jun 09, 2015", "Your typical pizza chain restaurant, you can usually get like half off your pizza is you sign up for their Papa Johns App or online account....", 4, 0, true], "36884330": ["Zomato", "Sangam Indian Cuisine", "7 months ago", "Good tasty food .... Every Indian in Ithaca must visit this place at least once. ... Staff is very good.... They have maintained their spicy...", 4, 0, false], "20823694": ["Zomato", "Stellas Barn", "Oct 30, 2011", "Fabulous! Wonderful atmosphere, service was great, food was great. We'll be back for sure.", 0, 0, true], "20823691": ["Zomato", "Stellas Barn", "Apr 07, 2011", "Maybe. Before I wrote yesterday's review, I had emailed Stella's Barn with my complaint. I received an email apology today from the owner. T...", 0, 0, false], "26900054": ["Zomato", "Hawi Ethiopian", "Apr 25, 2016", "I have are here a few times, good food. Each time the food was consistent. Parking is a bit difficult since its downtown on a one-way street...", 3.5, 0, true], "24766903": ["Zomato", "Hawi Ethiopian", "Aug 29, 2015", "I was SO excited when an Ethiopian restaurant finally opened in Ithaca as it is by far my favorite cuisine. However, Hawi was unfortunately ...", 3, 0, false], "24673968": ["Zomato", "Hawi Ethiopian", "Aug 20, 2015", "I've gone to this restaurant a total of 4 times and have only eaten there once.  One time they had no room for at least an hour and the othe...", 1.5, 0, false], "23671318": ["Zomato", "Hawi Ethiopian", "Apr 15, 2015", "Online Menu. There needs to be a online menu other than going to Face Book. Most employers will not allow you to go on face book while at wo...", 0, 0, false], "20821735": ["Zomato", "Ling Ling Garden", "Sep 23, 2012", "Meh. I was told that this was the best Chinese place in town, but I just didn't see anything special about it - not BAD, but not that good e...", 0, 0, false], "24327811": ["Zomato", "Miyake Japanese Restaurant", "Jul 17, 2015", "The sushi here is below average. I think they use a lot of rice and the fish is very bland. The Tuesday/Thursday deals are good though. Serv...", 2, 0, false], "20822026": ["Zomato", "Samurai", "Mar 16, 2010", "Fast service, average prices are $10 to $15 for a full meal. Sashimi was quite fresh, lunch comes with soup. Will definitely go again.", 0, 0, false], "20821423": ["Zomato", "College Town Pizza", "Feb 26, 2011", "Heavy and greasy. Very overrated and only for the desperate.", 0, 0, false], "20821420": ["Zomato", "College Town Pizza", "Apr 22, 2009", "Decent. Good, cheap pizza in college town; how can you go wrong?\r certain slices superior to others, go try it.", 0, 0, true], "26198495": ["Zomato", "Chili's", "Feb 06, 2016", "Good food but a little pricey. As a graduate at Cornell, I am always watching my expenses, but this was totally worth it. Our total cost cam...", 4, 0, false], "20823373": ["Zomato", "Chili's", "Dec 14, 2011", "Overpriced and Not cooked right. Food was typical Chili's, but tasted slightly off-cooked, like everything was put into the microwave. The b...", 0, 0, false], "20823370": ["Zomato", "Chili's", "Jun 05, 2010", "Nothing fancy but what you need. Sometimes you just want a good meal with good service. We have come to appreciate Chili's as the place to g...", 0, 0, false], "20821747": ["Zomato", "Louie's Lunch", "Jan 22, 2011", "Really awful experience. The burger was dry, the shake was made with cheap syrup and the fries were possibly the worst I've ever had. Avoid ...", 0, 0, false], "20822008": ["Zomato", "Rose Restaurant", "Apr 02, 2010", "Nice place, good food, great salad bar", 0, 0, true], "20823988": ["Zomato", "Jimmy John's", "Oct 15, 2010", "Incredibly fast delivery. I'm talking you hang up, and within 5 min. your sub is at your door in collegetown", 0, 0, true], "20821621": ["Zomato", "Jade Garden Restaurants", "Jan 26, 2013", "We wanted some standard, fried, sticky-sweet Chinese takeout, and this fit the bill. The fried dumplings were surprisingly good, but the cra...", 0, 0, false], "20821618": ["Zomato", "Jade Garden Restaurants", "Jul 04, 2010", "Reasonable prices for their menu, recommend the lunch buffet, which can also be ordered \"to go.\" Best bang for your buck.", 0, 0, false], "20821744": ["Zomato", "Little Thai House", "Jan 21, 2012", "Very disappointing. The egg rolls were dry and bland and didn't come with any sauce, and what was supposed to be lemongrass chicken was actu...", 0, 0, false]}